In [1]:
import numpy as np
import pandas as pd

## Series/ Serliler

In [2]:
benimSozlugum = {"Ali" : 30, "Mahmut" : 40, "Ayşe" : 20, "Kazım" : 35}

pd.Series(benimSozlugum)

Ali       30
Mahmut    40
Ayşe      20
Kazım     35
dtype: int64

In [3]:
benimYaslarim = [50, 30 ,40]
benimIsimlerim = ["Atil", "Zeynep", "Mehmet"]

pd.Series(data = benimYaslarim, index = benimIsimlerim)

Atil      50
Zeynep    30
Mehmet    40
dtype: int64

In [4]:
numpyDizim = np.array([50, 30, 40])

pd.Series(data = numpyDizim, index = benimIsimlerim)

Atil      50
Zeynep    30
Mehmet    40
dtype: int32

In [5]:
yarismaSonucu1 = pd.Series([10, 5, 3], ["Atil", "Atlas", "Osman"])

In [6]:
yarismaSonucu1

Atil     10
Atlas     5
Osman     3
dtype: int64

In [7]:
yarismaSonucu2 =  pd.Series([20, 12, 4], ["Atil", "Atlas", "Osman"])

In [8]:
yarismaSonucu2

Atil     20
Atlas    12
Osman     4
dtype: int64

In [9]:
yarismaSonucu2["Atlas"]

12

In [10]:
sonSonuc = yarismaSonucu1 + yarismaSonucu2

In [11]:
sonSonuc

Atil     30
Atlas    17
Osman     7
dtype: int64

In [12]:
sonSonuc["Atlas"]

17

In [13]:
dates = pd.date_range("20130101", periods=6)

In [14]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

## DATAFRAME

In [19]:
data = np.random.randint(1, 10, size= (4,3))

In [20]:
data

array([[6, 7, 8],
       [2, 6, 1],
       [2, 3, 6],
       [8, 2, 3]])

In [21]:
dataFrame = pd.DataFrame(data)

In [22]:
dataFrame

   0  1  2
0  6  7  8
1  2  6  1
2  2  3  6
3  8  2  3

In [23]:
dataFrame[2]

0    8
1    1
2    6
3    3
Name: 2, dtype: int32

In [24]:
type(dataFrame[0])

pandas.core.series.Series

In [25]:
dataFrame.head(3)

   0  1  2
0  6  7  8
1  2  6  1
2  2  3  6

In [26]:
dataFrame.tail(2)

   0  1  2
2  2  3  6
3  8  2  3

In [31]:
ran = ["Nihat", "Umut", "Serhat", "Hamza"]
yeniDataFrame = pd.DataFrame(data, index = ran, columns=["Yas", "Boy", "Kilo"])

In [32]:
yeniDataFrame

        Yas  Boy  Kilo
Nihat     6    7     8
Umut      2    6     1
Serhat    2    3     6
Hamza     8    2     3

In [33]:
yeniDataFrame["Yas"]

Nihat     6
Umut      2
Serhat    2
Hamza     8
Name: Yas, dtype: int32

In [34]:
yeniDataFrame.loc["Hamza"]

Yas     8
Boy     2
Kilo    3
Name: Hamza, dtype: int32

In [35]:
yeniDataFrame.loc["Hamza"]["Yas"]

8

In [36]:
yeniDataFrame.iloc[2] #bunu dediğimizde yusufunkini getirdi çünkü aslında index atadığım yerde ne olırsa olsun o yinede numaralıyor orayı

Yas     2
Boy     3
Kilo    6
Name: Serhat, dtype: int32

In [37]:
yeniDataFrame["Emeklilik yasi"] = np.random.randint(30,60,4)

In [38]:
yeniDataFrame

        Yas  Boy  Kilo  Emeklilik yasi
Nihat     6    7     8              35
Umut      2    6     1              34
Serhat    2    3     6              42
Hamza     8    2     3              48

In [39]:
yeniDataFrame.drop("Yas", axis=1) #buradaki 'axis' nereden sileceğini belirtmek için var

        Boy  Kilo  Emeklilik yasi
Nihat     7     8              35
Umut      6     1              34
Serhat    3     6              42
Hamza     2     3              48

In [40]:
yeniDataFrame.drop("Umut", axis=0)

        Yas  Boy  Kilo  Emeklilik yasi
Nihat     6    7     8              35
Serhat    2    3     6              42
Hamza     8    2     3              48

In [41]:
yeniDataFrame

        Yas  Boy  Kilo  Emeklilik yasi
Nihat     6    7     8              35
Umut      2    6     1              34
Serhat    2    3     6              42
Hamza     8    2     3              48

In [42]:
yeniDataFrame.drop("Yas", axis=1, inplace= True) #buradaki 'inplace' (yerinde) gerçekten sildiriyor.

In [45]:
yeniDataFrame

        Boy  Kilo  Emeklilik yasi
Nihat     7     8              35
Umut      6     1              34
Serhat    3     6              42
Hamza     2     3              48

In [46]:
yeniDataFrame[yeniDataFrame < 8]

        Boy  Kilo  Emeklilik yasi
Nihat     7   NaN             NaN
Umut      6   1.0             NaN
Serhat    3   6.0             NaN
Hamza     2   3.0             NaN

In [47]:
yeniDataFrame[yeniDataFrame["Emeklilik yasi"] > 40]

        Boy  Kilo  Emeklilik yasi
Serhat    3     6              42
Hamza     2     3              48

In [48]:
yeniDataFrame.reset_index()

    index  Boy  Kilo  Emeklilik yasi
0   Nihat    7     8              35
1    Umut    6     1              34
2  Serhat    3     6              42
3   Hamza    2     3              48

In [49]:
yeniDataFrame

        Boy  Kilo  Emeklilik yasi
Nihat     7     8              35
Umut      6     1              34
Serhat    3     6              42
Hamza     2     3              48

In [50]:
indexListesi = ["nih", "umu", "ser", "ham"]
yeniDataFrame["Yeni index"] =  indexListesi

In [51]:
yeniDataFrame

        Boy  Kilo  Emeklilik yasi Yeni index
Nihat     7     8              35        nih
Umut      6     1              34        umu
Serhat    3     6              42        ser
Hamza     2     3              48        ham

In [52]:
yeniDataFrame.set_index("Yeni index")

            Boy  Kilo  Emeklilik yasi
Yeni index
nih           7     8              35
umu           6     1              34
ser           3     6              42
ham           2     3              48

In [53]:
yeniDataFrame

        Boy  Kilo  Emeklilik yasi Yeni index
Nihat     7     8              35        nih
Umut      6     1              34        umu
Serhat    3     6              42        ser
Hamza     2     3              48        ham

In [54]:
yeniDataFrame.set_index("Yeni index", inplace=True)

In [55]:
yeniDataFrame

            Boy  Kilo  Emeklilik yasi
Yeni index
nih           7     8              35
umu           6     1              34
ser           3     6              42
ham           2     3              48

In [57]:
yeniDataFrame.loc["nih"]

Boy                7
Kilo               8
Emeklilik yasi    35
Name: nih, dtype: int32

In [58]:
disIndexler = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [59]:
icIndexler = ["Homer", "Bart", "Merge", "Cartman", "Kenny", "Kyle"]

In [60]:
birlesmisIndex = list(zip(disIndexler, icIndexler))

In [61]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Merge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [62]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [63]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Merge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [64]:
benimCizgiFilmListem = [[40, "A"], [30, "B"], [20, "C"], [9, "D"], [10, "E"], [11, "F"]]

In [54]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [65]:
cizgiFilmDataFrame = pd.DataFrame(benimCizgiFilmListem, index = birlesmisIndex, columns = ["Yas", "Meslek"]);

In [66]:
cizgiFilmDataFrame

                    Yas Meslek
Simpson    Homer     40      A
           Bart      30      B
           Merge     20      C
South Park Cartman    9      D
           Kenny     10      E
           Kyle      11      F

In [67]:
cizgiFilmDataFrame["Yas"]

Simpson     Homer      40
            Bart       30
            Merge      20
South Park  Cartman     9
            Kenny      10
            Kyle       11
Name: Yas, dtype: int64

In [58]:
cizgiFilmDataFrame.loc["Simpson"].loc["Homer"]

Yas       40
Meslek     A
Name: Homer, dtype: object

In [59]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   30      B
Merge  20      C

In [73]:
cizgiFilmDataFrame.index.names = ["Film adı", "İsim"]

In [74]:
cizgiFilmDataFrame

                    Yas Meslek
Film adı   İsim
Simpson    Homer     40      A
           Bart      30      B
           Merge     20      C
South Park Cartman    9      D
           Kenny     10      E
           Kyle      11      F

In [95]:
sozlukVerisi = {"Istanbul" : [30,np.nan,29], "Ankara" : [40,28,np.nan], "Izmır" : [31,30,40]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [96]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmır
0      30.0    40.0     31
1       NaN    28.0     30
2      29.0     NaN     40

In [97]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmır
0      30.0    40.0     31

In [98]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmır
0      30.0    40.0     31
1       NaN    28.0     30
2      29.0     NaN     40

In [99]:
havaDurumuDataFrame.dropna(axis=1)

   Izmır
0     31
1     30
2     40

In [100]:
sozlukVerisi = {"Istanbul" : [30,np.nan,29], "Ankara" : [40,28,np.nan], "Izmır" : [31,30,40], "Diyarbakir" : [40,np.nan,np.nan]}
yeniHavaDataFrame = pd.DataFrame(sozlukVerisi)

In [101]:
yeniHavaDataFrame

   Istanbul  Ankara  Izmır  Diyarbakir
0      30.0    40.0     31        40.0
1       NaN    28.0     30         NaN
2      29.0     NaN     40         NaN

In [108]:
yeniHavaDataFrame.dropna(axis = 1, thresh=2)

   Istanbul  Ankara  Izmır
0      30.0    40.0     31
1       NaN    28.0     30
2      29.0     NaN     40

In [109]:
yeniHavaDataFrame.fillna(10)

   Istanbul  Ankara  Izmır  Diyarbakir
0      30.0    40.0     31        40.0
1      10.0    28.0     30        10.0
2      29.0    10.0     40        10.0

## GroupBy

In [78]:
maasSozlugu = {"Departman" : ["Yazılım", "Yazılım", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"],
               "Calısan ismi" : ["Ahmet", "Nihat", "Burak", "Atil", "Mehmet", "Zeynep"],
               "Maas" : [600,700,500,400,300,200]
              }

In [79]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [80]:
maasDataFrame

   Departman Calısan ismi  Maas
0    Yazılım        Ahmet   600
1    Yazılım        Nihat   700
2  Pazarlama        Burak   500
3  Pazarlama         Atil   400
4      Hukuk       Mehmet   300
5      Hukuk       Zeynep   200

In [81]:
grupObjesi = maasDataFrame.groupby("Departman")

In [83]:
grupObjesi.count()

           Calısan ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [84]:
grupObjesi.mean()

            Maas
Departman
Hukuk      250.0
Pazarlama  450.0
Yazılım    650.0

In [85]:
grupObjesi.min()

          Calısan ismi  Maas
Departman
Hukuk           Mehmet   200
Pazarlama         Atil   400
Yazılım          Ahmet   600

In [86]:
grupObjesi.max()

          Calısan ismi  Maas
Departman
Hukuk           Zeynep   300
Pazarlama        Burak   500
Yazılım          Nihat   700

In [87]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Pazarlama   2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Yazılım     2.0  650.0  70.710678  600.0  625.0  650.0  675.0  700.0

## CONCAT

In [110]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"], 
           "Spor" : ["Koşu", "Yüzme","Koşu","Basketbol"],
          "Kalori" : [100,200,300,400]
          }
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [111]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [113]:
sozluk2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"], 
           "Spor" : ["Koşu", "Yüzme","Koşu","Basketbol"],
          "Kalori" : [200,100,50,300]
          }

dataFrame2 = pd.DataFrame(sozluk2,index = [4,5,6,7])

In [114]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [115]:
sozluk3 = {"Isim" : ["Ayse","Mahmut","Duygu","Nur"], 
           "Spor" : ["Koşu", "Yüzme","Badminton","Tenis"],
          "Kalori" : [300,400,500,250]
          }
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [116]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

In [117]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 0)## Burada axis=0 olduğu için alt alta yaptı eğer 1 olsaydı yanyana yapardı

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## MERGE

In [118]:
mergeSozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor" : ["Koşu","Yüzme","Koşu", "Basketbol"]
               }
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [119]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [120]:
mergeSozluk2 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori" : [100,200,150,250]
               }
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [121]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [122]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

## EKSTRALAR

In [123]:
maasSozluk = {"Isim" : ["Atıl","Zeynep","Mehmet","Ahmet"], 
             "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas" : [200,300,400,500]
             }
maasDataFrame = pd.DataFrame(maasSozluk)

In [124]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [126]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [127]:
maasDataFrame["Departman"].nunique()

3

In [128]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [129]:
def bruttenNete(maas):
    return maas * 0.66

In [130]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [131]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [132]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart","Bart"],
               "Karakter Yas" : [9,10,50,20,10]
              }

In [133]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [134]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [135]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10